Documents/ПоступлениеКонтрольныхЗнаков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ПоступлениеКонтрольныхЗнаков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОстаткиКЗ</xr:Item>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКонтрольныхЗнаков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОстаткиКЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ОстаткиКЗ</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДвижениеКонтрольныхЗнаков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Остатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Остатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ДвижениеКонтрольныхЗнаков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ДвижениеКонтрольныхЗнаков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИспользованоПоНазначению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ликвидация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утеря</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уничтожение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Хищение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Порча</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводственныйБрак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПредписанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеКонтрольныхЗнаков/Ext/ObjectModule.bsl
// <Описание функции>
//
//
// Возвращаемое значение:
//   Ссылка   - Ссылка на номенклатуру "Контрольные знаки"
//
&НаСервере
Функция ПолучитьКЗ()
	Возврат Справочники.Номенклатура.НайтиПоНаименованию("Контрольные знаки").Ссылка;
КонецФункции // ПолучитьКЗ()

// <Описание функции>
//
// Параметры:
//  Серия  - Текст - Серия контрольных знаков
//  НачальныйНомер  - Число - Начальный номер КОнтрольных знаков
//  КоличествоКонтрольныхЗнаков  - Число - Количество приходуемых контрольных знаков
//
// Возвращаемое значение:
//   Булево   - Истина если все хорошо, Ложь, если есть совпадения
//
&НаСервере
Функция ПроверкаПриходаКЗ(Серия, НачальныйНомер, КоличествоКонтрольныхЗнаков)
	
	Для НомерКЗ = НачальныйНомер По НачальныйНомер + КоличествоКонтрольныхЗнаков - 1 Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиКЗ.Серия КАК Серия,
		|	ОстаткиКЗ.Номер КАК Номер
		|ИЗ
		|	РегистрСведений.ОстаткиКЗ КАК ОстаткиКЗ
		|ГДЕ
		|	ОстаткиКЗ.Серия = &Серия
		|	И ОстаткиКЗ.Номер = &Номер";
		
		Запрос.Параметры.Вставить("Серия", Серия);
		Запрос.Параметры.Вставить("Номер", НомерКЗ);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат Ложь;
		КонецЦикла;
	КонецЦикла; 
	Возврат Истина;
	
	//ТаблицаКЗ = Новый ТаблицаЗначений;
	//ТаблицаКЗ.Колонки.Добавить("СерияКЗ", Тип("Строка"));
	//ТаблицаКЗ.Колонки.Добавить("НомерКЗ", Тип("Число"));
	//
	//Для НомерКЗ = НачальныйНомер По НачальныйНомер + КоличествоКонтрольныхЗнаков - 1 Цикл
	//	НоваСТрокаТЗ = ТаблицаКЗ.Добавить();
	//	НоваСТрокаТЗ.СерияКЗ = Серия;
	//	НоваСТрокаТЗ.НомерКЗ = НомерКЗ;
	//КонецЦикла; 
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ОстаткиКЗ.Серия КАК Серия,
	//|	ОстаткиКЗ.Номер КАК Номер
	//|ИЗ
	//|	РегистрСведений.ОстаткиКЗ КАК ОстаткиКЗ
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//|			ТКЗ.СерияКЗ КАК СерияКЗ,
	//|			ТКЗ.НомерКЗ КАК НомерКЗ
	//|		ИЗ
	//|			ТКЗ КАК ТКЗ) КАК ВложенныйЗапрос
	//|		ПО ОстаткиКЗ.Номер = ВложенныйЗапрос.НомерКЗ
	//|			И ОстаткиКЗ.Серия = ВложенныйЗапрос.СерияКЗ
	//|ГДЕ
	//|	ОстаткиКЗ.Серия = &Серия
	//|	И ОстаткиКЗ.Номер = &Номер";
	//
	//Запрос.Параметры.Вставить("Серия", Серия);
	//Запрос.Параметры.Вставить("Номер", НомерКЗ);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	Возврат Ложь;
	//КонецЦикла;
	//
	//Возврат Истина;
	
КонецФункции // ПроверкаПриходаКЗ()


#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	Процедура ОбработкаПроведения(Отказ, Режим)
		
		Если Не ПроверкаПриходаКЗ(Серия, НачальныйНомер, КоличествоКонтрольныхЗнаков) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Контрольные знаки уже использовались и не могут быть поставлены на приход";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
		// регистр ОстаткиКЗ
		Для НомерКЗ = НачальныйНомер По НачальныйНомер+КоличествоКонтрольныхЗнаков-1 Цикл
			Движения.ОстаткиКЗ.Записывать = Истина;
			Движение = Движения.ОстаткиКЗ.Добавить();
			Движение.Период = Дата;
			Движение.Серия = Серия;
			Движение.Номер = НомерКЗ;
			Движение.Состояние = Перечисления.ДвижениеКонтрольныхЗнаков.Поступление;
			Движение.Комментарий = Комментарий;
		КонецЦикла; 
		
		// регистр Остатки Приход
		Движения.Остатки.Записывать = Истина;
		Движение = Движения.Остатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Номенклатура = ПолучитьКЗ();
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Количество = КоличествоКонтрольныхЗнаков;
		Движение.Комментарий = Комментарий;
		
	КонецПроцедуры
	
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

#КонецОбласти
